app/controllers/service_providers/registrations_controller.rb

INSERT INTO "service_provider_details" ("company_name", "created_at", "insurance", "insurance_amount", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    self.resource = ServiceProvider.new(params[:service_provider])
    resource.build_service_provider_detail if resource.service_provider_detail.nil?
    resource.services.build unless resource.services.present?
    resource.certifications.build unless resource.certifications.present?

    if resource.save